[
  {
    "input": "The Milky Way galaxy is a barred spiral galaxy that contains our solar system. It's estimated to be about 100,000 light-years in diameter, comprising hundreds of billions of stars, stellar remnants, interstellar gas, dust, and various types of interstellar matter. The Milky Way is just one of billions of galaxies in the observable universe, and its structure includes a central bulge and spiral arms of stars, gas, and dust. Our solar system is located in one of these spiral arms, known as the Orion Arm. The Milky Way is visible as a hazy band of light in the night sky, particularly in areas with minimal light pollution, due to the presence of countless stars.",
    "summary": "The Milky Way galaxy is a large spiral galaxy where our solar system is located. It is made up of billions of stars, gas, dust, and other space materials. The galaxy has a central bulge and spiral arms, with our solar system being in one of these arms called the Orion Arm. The Milky Way is just one of many galaxies in the universe and can be seen in the night sky as a faint band of light.",
    "qa": "Q: What is the estimated size of the Milky Way galaxy?\nA: The Milky Way galaxy is estimated to be about 100,000 light-years in diameter.\n\nQ: Where is our solar system located within the Milky Way?\nA: Our solar system is located in one of the spiral arms of the Milky Way known as the Orion Arm.\n\nQ: How is the Milky Way visible in the night sky?\nA: The Milky Way is visible as a hazy band of light in the night sky, particularly in areas with minimal light pollution, due to the presence of countless stars."
  },
  {
    "input": "Human psychology is the study of human behavior, mental processes, and emotional experiences. It explores the complex interactions between cognitive, emotional, and environmental factors that influence how people think, feel, and behave. Human psychology encompasses various aspects, including perception, motivation, learning, memory, and social interactions, aiming to understand individuals' experiences, emotions, and behaviors. By examining these factors, psychologists can develop interventions and strategies to promote mental health, well-being, and personal growth.",
    "summary": "Human psychology is the study of how people think, feel, and act. It looks at how factors like emotions, thoughts, and surroundings affect behavior. It covers topics like perception, motivation, learning, memory, and social interactions. Psychologists use this knowledge to help improve mental health and personal growth.",
    "qa": "Q: What is human psychology? \nA: Human psychology is the study of human behavior, mental processes, and emotional experiences.\n\nQ: What factors does human psychology explore in understanding how people think, feel, and behave? \nA: Human psychology explores the interactions between cognitive, emotional, and environmental factors that influence individuals' experiences, emotions, and behaviors.\n\nQ: How can psychologists use their understanding of human psychology to promote mental health and personal growth? \nA: By examining factors such as perception, motivation, learning, memory, and social interactions, psychologists can develop interventions and strategies to promote mental health, well-being, and personal growth."
  },
  {
    "input": "A lion pride is a complex social structure typically consisting of several females, their cubs, and one or more males. The females in a pride are usually related, and the pride's stability is often centered around them. The males may come and go over time, often staying with the pride for a few years before being replaced by other males. Lion prides are known for their cooperative behavior, with females working together to hunt and protect their territory, while males primarily focus on protecting the pride from external threats and rival males. This social structure is unique among big cats and plays a crucial role in the survival and success of lions in their habitats.",
    "summary": "A lion pride is like a family made up of several females, their babies, and a few males. The females are usually related and keep the pride stable. Males come and go but help protect the family from dangers. Lions work together to hunt and defend their territory, which helps them survive and thrive in their environments.",
    "qa": "Q: What is the typical composition of a lion pride?\nA: A lion pride typically consists of several females, their cubs, and one or more males.\n\nQ: How do lion prides exhibit cooperative behavior?\nA: Lion prides exhibit cooperative behavior by females working together to hunt and protect their territory, while males primarily focus on protecting the pride from external threats and rival males."
  },
  {
    "input": "Memorandum of Understanding (MoU) for Nawaz Marts Mureedwala Between Partner 1: NCC-AKB(JV) And Partner 2: Rehan Shafi Closing Inventory 1641522/- (One Million Six Hundred and Forty One Thousands Five Hundred and Twenty Two) was the closing inventory at time of the handing/taking. Which was duly counted in the presence of the representatives of both parties. Partner 2 should have to pay the full amount of the inventory in a period of 1-2 months according to the status of the service area. Profit Sharing Criteria and Percentage Partnership is based on the profit sharing on the Net Profit basis. Net profit will be calculated from the online sales system. Partner 1 will receive 75% of the calculated net profit and the remaining 25% will be paid to partner 2. Profit Distribution Mechanism Profit will be distributed among the partners 3 times in a month 1. 10th day of each month 2. 20th day of each month 3. End of the month with complete audit report Operations and Management Inventory management, purchasing, pricing and staff management are all the responsibility of the Partner 2. However Partner 1 has rights to suggest/implement anything to enhance the sales. Partner 1 also can ask for any record related to sale and purchase of the inventory to ensure the transparency of the process. Duration Duration of the partnership is kept flexible and can be decided with the mutual understanding of the partners. Any partner can terminate the contract with one month notice period. Date: 01 March 2022",
    "summary": "A Memorandum of Understanding (MoU) was signed between NCC-AKB(JV) and Rehan Shafi for Nawaz Marts Mureedwala. The closing inventory at the time of handover was 1641522/-. Partner 2 is responsible for paying the full amount within 1-2 months. The profit sharing criteria is based on net profit, with Partner 1 receiving 75% and Partner 2 receiving 25%. Profit will be distributed three times a month. Partner 2 is responsible for inventory management, purchasing, pricing, and staff management, while Partner 1 can suggest improvements and request records for transparency. The partnership duration is flexible and can be ended with one month notice.",
    "qa": "Q: What was the closing inventory at Nawaz Marts Mureedwala at the time of handing/taking in the MoU?\nA: The closing inventory at Nawaz Marts Mureedwala was 1,641,522/- (One Million Six Hundred and Forty One Thousands Five Hundred Twenty Two).\n\nQ: How is the profit shared between Partner 1 and Partner 2 in the MoU?\nA: The profit sharing in the MoU is based on the Net Profit basis, with Partner 1 receiving 75% of the calculated net profit and Partner 2 receiving the remaining 25%.\n\nQ: What are the three times in a month when profit will be distributed among the partners according to the MoU?\nA: Profit will be distributed among the partners on the 10th day, 20th day, and end of the month with a complete audit report."
  },
  {
    "input": "TECHNO GROUP OF INDUSTRIES Visit: Fb.me/tgielectronics or Email: info@technogroupofindustries.com | TGI 03-111-999-412 03-000-399-399 Details: PV Solar Panels 264 * 570/590W Tier 1 (JA, JINKO, LONGI,CANADIAN) INV. 50*3 KW Ongrid Inverter ( Techno ) MO-02 Customize/Galvanized Panels Mounting Frame for Solar Panels, Made of 14 Gauge GI Sheet or Iron, Rust free, Anti Rust color and Durable. Acc MC4 Connectors/ Branch connectors / Installation Accessories D-01 Distribution Box + DC Breakers + Ac breakers + AC SPDs + DC SPDs etc.(Civil Work is not a part of our job) W-01 Solar Cable for Solar Panels W-02 6 MM DC Wire Pure Copper W-03 AC wire from Inverter to Main W-04 Designing, commissioning with complete fitting and Installation W-06 Earthing Boreing with Lightening arrester  Solar Inverter ( 10 years Brand Guarantee )  Solar Panels ( 10/25 years Performance warranty)  Solar Stands ( 3 Year warranty)  Free Service ( 1 Years)  No warranty in case of breakage & overload  Batteries not Included The Price Mentioned is without tax Payment 100 % Advance NEPRA, WAPDA charges & demand notes paid by customer For Query? Email us at: info@technogroupofindustries.com Message or WhatsApp us at 03-111-999-412 Quotation 30 April 2024 This quotation is valid for 6 days Mr. Muhammad Rehan 150KW Ongrid Solar Power System Total Price Rs.17,250,000 /=",
    "summary": "Techno Group of Industries is offering a package for a 150KW Ongrid Solar Power System. It includes PV Solar Panels, Inverter, Mounting Frame, Connectors, Cables, Distribution Box, and more. The warranty is provided for certain components and services. The total price is Rs.17,250,000, with payment required in advance. Any additional charges need to be paid by the customer. The quotation is valid until 30 April 2024. For more information, contact Techno Group of Industries via email or WhatsApp.",
    "qa": "Q: What are some key components included in the 150KW Ongrid Solar Power System offered by TECHNO GROUP OF INDUSTRIES?\nA: Some key components included are PV Solar Panels, Ongrid Inverter, Mounting Frame for Solar Panels, MC4 Connectors, Distribution Box, Solar Cable, DC and AC wires, and Earthing Boreing with Lightening arrester.\n\nQ: What warranties are provided for the different components of the solar power system?\nA: The Solar Inverter comes with a 10 years Brand Guarantee, Solar Panels have a 10/25 years Performance warranty, and Solar Stands have a 3 Year warranty. Additionally, there is a 1-year Free Service provided, but there is no warranty in case of breakage or overload.\n\nQ: What payment terms and conditions are mentioned in the quotation?\nA: The Price of Rs.17,250,000 is mentioned without tax, and the payment terms require 100% advance payment. NEPRA, WAPDA charges, and demand notes are to be paid by the customer. The quotation is valid for 6 days from the date of issue, and the customer's query can be addressed via email, message, or WhatsApp."
  },
  {
    "input": "First of all I would like to introduce with our company. We are in the software development business from past 10 years. Since then, our team has expanded to include experienced Project Managers, Senior Developers and Business Analyst experts. We have wide range of areas of expertise which includes Custom Business Software Websites Development Ecommerce Websites Data Warehousing and Business Intelligence Enterprise Resource Planning Applications Content Management Systems SaaS Solutions Mobile Apps on iOS, Android, Blackberry and Windows Phone 3rd Party Integrations and API Authoring Search Engine optimization Most of our clients are from USA, Canada , Austrailia and Europian Countries. Accueil | Aix-Marseille Université (univ-amu.fr) Université Grenoble Alpes (univ-grenoble-alpes.fr) Similar Projects and multi-lingual We have also previously worked on the couple of French universities websites for Aix- Marslisse Univerity and Université Grenoble Alpes. Both site are multi-lingual application in English and French. Our Development Process We are following the Agile Model Technique in the development. \"Agile process model\" refers to a software development approach based on iterative development. By using Agile methods we will break tasks into smaller iterations. The project scope and requirements are laid down at the beginning of the development process. We will Plans regarding the number of iterations, the duration and the scope of each iteration are clearly defined in advance. Each iteration should considered as a short time \"frame\" in the Agile process model, which typically lasts from three to four weeks. The division of the entire project into smaller parts helps to minimize the project risk and to reduce the overall project delivery time requirements. Each iteration involves a team working through a full software development life cycle including planning, requirements analysis, design, coding, and testing before a working product is demonstrated to the client. Phases of Agile Model: We will follow the Following phases in the Agile model: Requirements gathering Design the requirements Construction/ iteration Testing/ Quality assurance Deployment Feedback Scrum We will follow the SCURM as Agile Testing Method SCRUM is an agile development process focused primarily on ways to manage tasks in team-based development conditions. There are three roles in it, and their responsibilities are: Scrum Master: The scrum can set up the master team, arrange the meeting and remove obstacles for the process Product owner: The product owner makes the product backlog, prioritizes the delay and is responsible for the distribution of functionality on each repetition. Scrum Team: The team manages its work and organizes the work to complete the sprint or cycle. UI/UX I have fully reviewed the UoM current website and found that the designer of the site completely ignored the UI/UX design techniques. In our company we start each application/website by following the latest design techniques are tools UI design and UX design are two of the most often confused terms in web and app design. They’re usually placed together in a single term, UI/UX design. What is UI Design? Normally companies only work on the User Interface side of the application which includes the graphical layout of an application like, formate of the text they read, the images, sliders, text entry fields, and all the rest of the items the user interacts with. Also it includes layout, transitions, interface animations and every single micro-interaction. Any sort of visual element, interaction, or animation must all be designed. UI designers are basically graphic designers. They’re concerned with aesthetics. It’s up to them to make sure the application’s interface is attractive, visually-stimulating and themed appropriately to match the purpose and/or personality of the app. And they need to make sure every single visual element feels united, both aesthetically, and in purpose. What is UX Design? We have skilled UX designers in our team which works “UX” stands for “user experience.” A user’s experience of the app is determined by how they interact with it. Is the experience smooth and intuitive or clunky and confusing? Does navigating the app feel logical or does it feel arbitrary? Does interacting with the app give people the sense that they’re efficiently accomplishing the tasks they set out to achieve or does it feel like a struggle? User experience is determined by how easy or difficult it is to interact with the user interface elements that the UI designers have created. Photo by CareerFoundry So UX designers are also concerned with an application’s user interface, and this is why people get confused about the difference between the two. But whereas UI designers are tasked with deciding how the user interface will look, UX designers are in charge of determining how the user interface operates. They determine the structure of the interface and the functionality. How it’s organized and how all the parts relate to one another. In short, they design how the interface works. If it works well and feels seamless, the user will have a good experience. But if navigation is complicated or unintuitive, then a lousy user experience is likely. UX designers work to avoid the second scenario. How They Work Together So a UX designer decides how the user interface works while the UI designer decides how the user interface looks. This is a very collaborative process, and the two design teams tend to work closely together. Bootsrap We are using boostrap for UI responsive design as you know Bootstrap is a potent front-end framework used to create modern websites and web apps. It’s open-source and free to use, yet features numerous HTML and CSS templates for UI interface elements such as buttons and forms. Bootstrap also supports JavaScript extensions. it has a lot of components, a good grid system, styling for many HTML elements ranging from typography to buttons, as well as support of JavaScript plugins, making it even more flexible. Bootstrap is great for creating layouts, as its responsive CSS is designed to conform to different devices. It can be employed to ensure consistency, eliminate cross-browser issues, and so on. HTML 5",
    "summary": "Our company has been in the software development business for 10 years, with expertise in a wide range of areas including custom business software, websites, mobile apps, and search engine optimization. We follow the Agile development model, breaking tasks into smaller iterations to minimize risks and reduce project delivery time. We use the Scrum method for agile testing, with roles for Scrum Master, Product Owner, and Scrum Team. Our team focuses on both UI and UX design, with UI designers handling the look of the interface and UX designers focusing on how the interface operates. We utilize Bootstrap for responsive UI design, as it is a powerful framework with numerous templates and components for creating modern websites and web apps.",
    "qa": "Q: What areas of expertise does the company have in software development?\nA: The company has expertise in Custom Business Software, Website Development, Ecommerce Websites, Data Warehousing, Business Intelligence, Enterprise Resource Planning Applications, Content Management Systems, SaaS Solutions, Mobile Apps, 3rd Party Integrations, API Authoring, and Search Engine Optimization.\n\nQ: What is the Agile Model Technique in software development?\nA: The Agile Model Technique is a software development approach based on iterative development, where tasks are broken into smaller iterations with clear plans regarding the number of iterations, duration, and scope. Each iteration involves planning, requirements analysis, design, coding, and testing before a working product is demonstrated to the client.\n\nQ: What is the difference between UI Design and UX Design?\nA: UI Design focuses on the graphical layout of an application, including aesthetics, visual elements, transitions, and animations. On the other hand, UX Design focuses on the overall user experience, determining how the user interface operates, the structure, and functionality to ensure a smooth and intuitive interaction for users."
  },
  {
    "input": "Exercise: Spreadsheet Formatting Class 4 The City School/Academics/Computing Curriculum/Class 4/2023-2024 Page 1 of 2 Exercise Handout # 2 of Spreadsheet Formatting Part A: 1. Load MS Excel, and open the spreadsheet Flower Store.xls from the Desktop. You will see the data for the three months sale of flowers at a flower shop. 2. Enter the text “Total Income” in E1 cell. 3. Calculate the total sale of three months in cell E2, using either the SUM function or by using relevant mathematical operator. 4. Use the Autofill feature to replicate the same function in the range E3:E8 to calculate the total sale of each flower in three months. 5. Enter the text “Average Sale” in F1 cell. 6. Similarly calculate the average sale of each flower in column F using the Average function or by using the relevant mathematical operators. 7. Enter the text “Flower Price” in G1 cell. 8. In column G, enter the price of each flower as shown in the table: 9. Go to cell A9, and type the text “Sale of flowers in each month” and calculate the sale of flowers each month and total income in row # 9 using the SUM function. 10. Bold the data of row # 9. 11. Write the following text in the designated cells: A11 = Minimum Sale A12 = Maximum Sale 12. Calculate the minimum and maximum sale of flowers each month in the appropriate cells of row 11 and 12. 13. Save your worksheet as Ex2<<yourname>>.xls. Exercise: Spreadsheet Formatting Class 4 The City School/Academics/Computing Curriculum/Class 4/2023-2024 Page 2 of 2 Part B: 14. Open the worksheet as Ex2<<yourname>>.xls which you created in the previous week. 15. Adjust the row height and column width of the cells as required. 16. Add two decimal points to all values of Total Income and Average Sale column. 17. Insert four rows at the beginning of the sheet. 18. Merge and Center align the cells range A1: G1 and enter the heading “Sale Information of Flowers”. 19. Center align, bold and underline the heading. 20. Enter your name, class and section in cell A3. 21. Bold and italicize the headings of row # 5. 22. The vertical alignment of entire text should be center. 23. Apply “All Borders” on the data table except for Min and Max sale data. 24. Apply a “thick box border” on the outer boundary of the data table and also on the data of row # 5 and row # 9. 25. Insert a column chart to display the “Name of flowers and their total income” from the data table. 26. Apply your desired layout to this chart and enter the heading “Total Sale of Flowers in First Quarter” in the chart heading area. 27. Insert the text “Number of cells containing numbers” in A18 cell. 28. Use the COUNT function to calculate the “number of cells containing number” within the cell range (A5:G13) in B18 cell. 29. Insert the text “Length of A13” in A19 cell. 30. Use the LEN function to calculate the “length of text” of A13 in B19 cell. 31. Use the NOW function to insert current data and time in cell A21. 32. Change the page orientation to landscape, paper size to A4, and 0.5 inch margins on all sides. 33. Select “Fit Sheet on One Page” scaling option to print the entire sheet with graph on one page. 34. Save your worksheet as Ex2<<yourname>>. 35. Preview your worksheet, and take a printout of your work.",
    "summary": "In this exercise, you will be using Microsoft Excel to work on a spreadsheet about the sale of flowers at a flower shop. You will be calculating the total income and average sale of flowers, entering prices of flowers, calculating monthly sales, finding minimum and maximum sales, adjusting formatting, inserting a chart to display data, using functions to count cells with numbers and calculate the length of text, inserting the current date and time, changing page settings, and saving and printing your worksheet. This exercise will help you practice formatting and using different functions in Excel.",
    "qa": "Q: What is the purpose of entering \"Total Income\" and \"Average Sale\" in specific cells in the spreadsheet?\nA: Entering \"Total Income\" helps calculate the total sale of flowers for three months, and \"Average Sale\" helps calculate the average sale of each flower in the spreadsheet.\n\nQ: How can you calculate the minimum and maximum sale of flowers each month in the spreadsheet?\nA: You can use the MIN and MAX functions to calculate the minimum and maximum sale of flowers each month in the appropriate cells of rows 11 and 12."
  },
  {
    "input": "Whales are large, intelligent, and social marine mammals that belong to the order Cetacea. They are known for their massive size, with some species reaching lengths of up to 100 feet and weighing over 200 tons. Whales are adapted to life in the ocean, with streamlined bodies, flippers, and a thick layer of blubber to keep them warm in cold water. They are filter feeders or predators, feeding on tiny crustaceans, plankton, or small fish. Whales are also known for their complex vocalizations, which they use for communication and echolocation. Many species of whales are migratory, traveling long distances each year to find food or mate. Despite their size, whales are incredibly agile and have been observed exhibiting complex behaviors, such as breaching and lobtailing.",
    "summary": "Whales are big, smart, and social animals that live in the ocean. They have streamlined bodies, flippers, and blubber to stay warm. Whales eat tiny creatures or fish and make sounds to communicate. They travel long distances to find food or mate and can do cool tricks like breaching and lobtailing.",
    "qa": "Q: What are some adaptations that whales have for life in the ocean?\nA: Whales have streamlined bodies, flippers, and a thick layer of blubber to keep them warm in cold water.\n\nQ: What do whales feed on?\nA: Whales are either filter feeders or predators, feeding on tiny crustaceans, plankton, or small fish.\n\nQ: How do whales communicate with each other?\nA: Whales use complex vocalizations for communication and echolocation."
  }
]